<center>
<img src="../../img/ods_stickers.jpg" />
    
## [mlcourse.ai](mlcourse.ai) â€“ Open Machine Learning Course 
Author: Arina Lopukhova (@erynn). Edited by [Yury Kashnitskiy](https://yorko.github.io) (@yorko). This material is subject to the terms and conditions of the [Creative Commons CC BY-NC-SA 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/) license. Free use is permitted for any non-commercial purpose.

<h1><center>Assignment #1. Fall 2018</center></h1>
<h2><center>Exploratory data analysis of Olympic games with Pandas</center></h2>

__There are ten questions about [120 years of Olympic history: athletes and results](https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results/version/2) dataset in this task. Your task is to fill in the missing Python code and choose answers in [this web-form](https://docs.google.com/forms/d/179HYvlF_0x435CWdu2aOtR9a3flh0YCQXXNXhXaKw2M).__

Download the file `athlete_events.csv` from [Kaggle page](https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results). The dataset has the following features (copied from Kaggle):

- __ID__ - Unique number for each athlete
- __Name__ - Athlete's name
- __Sex__ - M or F
- __Age__ - Integer
- __Height__ - In centimeters
- __Weight__ - In kilograms
- __Team__ - Team name
- __NOC__ - National Olympic Committee 3-letter code
- __Games__ - Year and season
- __Year__ - Integer
- __Season__ - Summer or Winter
- __City__ - Host city
- __Sport__ - Sport
- __Event__ - Event
- __Medal__ - Gold, Silver, Bronze, or NA

In [1]:
import pandas as pd

In [2]:
# Change the path to the dataset file if needed. 
PATH = '../../data/athlete_events.csv'

In [3]:
data = pd.read_csv(PATH)
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

__1. How old were the youngest male and female participants of the 1996 Olympics?__

- 16 and 15
- 14 and 12 
- 16 and 12
- 13 and 11

In [228]:
# You code here First solution
data[(data['Sex'] == 'M') & (data['Year'] == 1996)]['Age'].min()

14.0

In [229]:
data[(data['Sex'] == 'F') & (data['Year'] == 1996)]['Age'].min()

12.0

In [230]:
# You code here Second solution
data[data['Year']==1996].groupby('Sex')['Age'].min()

Sex
F    12.0
M    14.0
Name: Age, dtype: float64

__2. What was the percentage of male gymnasts among all the male participants of the 2000 Olympics? Round the answer to the first decimal.__

*Hint:* here and further if needed drop duplicated sportsmen to count only unique ones. 

- 0.2
- 1.5 
- 2.5
- 7.7

In [231]:
data.head(1)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN

In [261]:
data[(data['Sex'] == 'M') & (data['Sport'] == 'Gymnastics') * (data['Year'] == 2000)]['Name'].drop_duplicates().count() / \
data[(data['Sex'] == 'M') & (data['Year'] == 2000)]['Name'].drop_duplicates().count()

/anaconda3/lib/python3.6/site-packages/pandas/core/computation/expressions.py:179: UserWarning: evaluating in Python space because the '*' operator is not supported by numexpr for the bool dtype, use '&' instead
  .format(op=op_str, alt_op=unsupported[op_str]))

0.014750608272506082

In [256]:
0.01475 * 100

1.4749999999999999

In [258]:
data[data.index == 439]

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
438,244,Raouf Abdelraouf,M,22.0,167.0,63.0,Egypt,EGY,2000 Summer,2000,Summer,Sydney,Gymnastics,Gymnastics Men's Horse Vault,NaN

In [259]:
data[data['Name'] == 'Raouf Abdelraouf']

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
437,244,Raouf Abdelraouf,M,22.0,167.0,63.0,Egypt,EGY,2000 Summer,2000,Summer,Sydney,Gymnastics,Gymnastics Men's Individual All-Around,NaN
438,244,Raouf Abdelraouf,M,22.0,167.0,63.0,Egypt,EGY,2000 Summer,2000,Summer,Sydney,Gymnastics,Gymnastics Men's Horse Vault,NaN
439,244,Raouf Abdelraouf,M,22.0,167.0,63.0,Egypt,EGY,2000 Summer,2000,Summer,Sydney,Gymnastics,Gymnastics Men's Parallel Bars,NaN
440,244,Raouf Abdelraouf,M,22.0,167.0,63.0,Egypt,EGY,2000 Summer,2000,Summer,Sydney,Gymnastics,Gymnastics Men's Rings,NaN
441,244,Raouf Abdelraouf,M,22.0,167.0,63.0,Egypt,EGY,2000 Summer,2000,Summer,Sydney,Gymnastics,Gymnastics Men's Pommelled Horse,NaN

In [257]:
data[(data['Sex'] == 'M') & (data['Sport'] == 'Gymnastics') * (data['Year'] == 2000)]['Name'].duplicated()

/anaconda3/lib/python3.6/site-packages/pandas/core/computation/expressions.py:179: UserWarning: evaluating in Python space because the '*' operator is not supported by numexpr for the bool dtype, use '&' instead
  .format(op=op_str, alt_op=unsupported[op_str]))

437       False
438        True
439        True
440        True
441        True
4536      False
4537       True
4538       True
4539       True
4540       True
4541       True
4542       True
5770      False
5771       True
5772       True
5773       True
5774       True
5775       True
5776       True
5777       True
14948     False
14949      True
14950      True
14951      True
14952      True
14953      True
14954      True
14955      True
19603     False
19604      True
          ...
266005     True
266006     True
266007     True
266008     True
266009     True
266010     True
266417    False
266418     True
266419     True
266420     True
266421     True
266422     True
266423     True
266424     True
269262    False
269263     True
269264     True
269265     True
269266     True
269267     True
269268     True
269269     True
270482    False
270483     True
270484     True
270485     True
270486     True
270487     True
270488     True
270489     True
Name: Name, Length: 642, dtype: bool

In [250]:
data[(data['Year'] == 2000)]['Name'].duplicated()

31        False
33        False
57        False
81        False
93        False
103       False
104        True
146       False
165       False
166        True
168       False
178       False
184       False
220       False
242       False
247       False
259       False
262       False
264       False
270       False
285       False
288       False
318       False
319       False
324       False
329       False
331       False
390       False
391       False
392       False
          ...
270562    False
270632    False
270633     True
270634     True
270635     True
270645    False
270712    False
270728    False
270729    False
270730     True
270731    False
270732     True
270736    False
270741    False
270766    False
270767     True
270775    False
270776     True
270820    False
270847    False
270848     True
270970    False
270979    False
270980     True
271008    False
271011    False
271012     True
271102    False
271105    False
271108    False
Name: Name, Length: 13821, dtype: bool

In [45]:
round(len(data[(data['Sport'] == 'Gymnastics') & (data['Sex'] == 'M') & (data['Year'] == 2000)].drop_duplicates()) / \
len(data[(data['Sex'] == 'M') & (data['Year'] == 2000)].drop_duplicates()) * 100, 1)

7.7

In [208]:
round(len(data[(data['Sport'] == 'Gymnastics') & (data['Sex'] == 'M') & (data['Year'] == 2000)]) / \
len(data[(data['Sex'] == 'M') & (data['Year'] == 2000)]) * 100, 1)

7.7

In [209]:
len(data)

271116

In [210]:
len(data.drop_duplicates())

269731

In [226]:
round(len(df[(df['Sport'] == 'Gymnastics') & (df['Sex'] == 'M') & (df['Year'] == 2000)]) / \
len(df[(df['Sex'] == 'M') & (df['Year'] == 2000)]) * 100, 1)

1.5

__3. What are the mean and standard deviation of height for female basketball players participated in the 2000 Olympics? Round the answer to the first decimal.__

- 178.5 and 7.2
- 179.4 and 10
- 180.7 and 6.7
- 182.4 and 9.1

In [274]:
new_df = data.drop_duplicates(subset='Name')

In [275]:
new_df.head(1)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN

In [287]:
new_dff  = data[(data['Sex'] == 'F') & (data['Sport'] == 'Basketball') & (data['Year'] == 2000)].drop_duplicates()

In [294]:
new_dff['Height'].mean()

182.38732394366198

In [296]:
new_dff['Height'].std()

9.139462087892174

In [290]:
len(new_dff)

142

In [291]:
len(data)

271116

In [279]:
new_df[(new_df['Sex'] == 'F') & (new_df['Year'] == 2000) & (new_df['Sport'] == 'Basketball')]['Height'].mean(skipna=True)

181.90322580645162

In [280]:
new_df[(new_df['Sex'] == 'F') & (new_df['Year'] == 2000) & (new_df['Sport'] == 'Basketball')]['Height'].std(skipna=True)

9.232579973080483

In [282]:
# You code here 
print ("Mean: {}".format(round(data[(data['Sex'] == 'F') & 
                                    (data['Year'] == 2000) & (data['Sport'] == 'Basketball')]['Height'].mean(skipna=True), 1)))
print ("Std: {}".format(round(data[(data['Sex'] == 'F') & 
                                   (data['Year'] == 2000) & (data['Sport'] == 'Basketball')]['Height'].std(skipna=True),1)))

Mean: 182.4
Std: 9.1

In [270]:
df = data.drop_duplicates(subset='Name')

In [271]:
len(df)

134732

In [273]:
print ("Mean: {}".format(round(df[(df['Sex'] == 'F') & 
                                    (df['Year'] == 2000) & (df['Sport'] == 'Basketball')]['Height'].mean(), 1)))
print ("Std: {}".format(round(df[(df['Sex'] == 'F') & 
                                   (df['Year'] == 2000) & (df['Sport'] == 'Basketball')]['Height'].std(),1)))

Mean: 181.9
Std: 9.2

In [ ]:
print ("Mean: {}".format(round(data[(data['Sex'] == 'F') & 
                                    (data['Year'] == 2000) & (data['Sport'] == 'Basketball')]['Height'].mean(), 1)))
print ("Std: {}".format(round(data[(data['Sex'] == 'F') & 
                                   (data['Year'] == 2000) & (data['Sport'] == 'Basketball')]['Height'].std(),1)))

__4. Find a sportsperson participated in the 2002 Olympics, with the highest weight among other participants of the same Olympics. What sport did he or she do?__

- Judo
- Bobsleigh 
- Weightlifting
- Boxing

In [297]:
data.head(1)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN

In [298]:
max_weight = data[data['Year'] == 2002]['Weight'].max()

In [299]:
max_weight

123.0

In [301]:
persons_name = data[(data['Year'] == 2002) & (data['Weight'] == max_weight)]['Name']

In [309]:
persons_name

99154    Emmanuel Hostache
Name: Name, dtype: object

In [310]:
data[(data['Year'] == 2002) & (data['Name'] == 'Emmanuel Hostache')]

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
99154,50171,Emmanuel Hostache,M,26.0,190.0,123.0,France,FRA,2002 Winter,2002,Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Two,NaN

In [59]:
data.head(2)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN

In [66]:
# You code here 
highest_weight = data[data['Year'] == 2002]['Weight'].max()
data[(data['Weight'] == highest_weight) & (data['Year'] == 2002)]['Name']

99154    Emmanuel Hostache
Name: Name, dtype: object

In [67]:
data[(data['Weight'] == highest_weight) & (data['Year'] == 2002)]['Sport']

99154    Bobsleigh
Name: Sport, dtype: object

In [69]:
data[(data['Name'] == 'Emmanuel Hostache') & (data['Year'] ==  2002)]['Sport']

99154    Bobsleigh
Name: Sport, dtype: object

__5. How many times did Pawe Abratkiewicz participate in the Olympics held in different years?__

- 0
- 1 
- 2
- 3

In [312]:
data[data['Name'] == 'Pawe Abratkiewicz']

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
997,562,Pawe Abratkiewicz,M,21.0,183.0,84.0,Poland,POL,1992 Winter,1992,Winter,Albertville,Speed Skating,Speed Skating Men's 500 metres,NaN
998,562,Pawe Abratkiewicz,M,21.0,183.0,84.0,Poland,POL,1992 Winter,1992,Winter,Albertville,Speed Skating,"Speed Skating Men's 1,000 metres",NaN
999,562,Pawe Abratkiewicz,M,27.0,183.0,84.0,Poland,POL,1998 Winter,1998,Winter,Nagano,Speed Skating,Speed Skating Men's 500 metres,NaN
1000,562,Pawe Abratkiewicz,M,27.0,183.0,84.0,Poland,POL,1998 Winter,1998,Winter,Nagano,Speed Skating,"Speed Skating Men's 1,000 metres",NaN
1001,562,Pawe Abratkiewicz,M,31.0,183.0,84.0,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Speed Skating,Speed Skating Men's 500 metres,NaN
1002,562,Pawe Abratkiewicz,M,31.0,183.0,84.0,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Speed Skating,"Speed Skating Men's 1,000 metres",NaN

In [76]:
data[data['Name'] == 'Pawe Abratkiewicz'].groupby('Year').count()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Season,City,Sport,Event,Medal
Year,,,,,,,,,,,,,,
1992,2,2,2,2,2,2,2,2,2,2,2,2,2,0
1998,2,2,2,2,2,2,2,2,2,2,2,2,2,0
2002,2,2,2,2,2,2,2,2,2,2,2,2,2,0

In [75]:
len(data[data['Name'] == 'Pawe Abratkiewicz'].groupby('Year').count())

3

In [8]:
# You code here

__6. How many silver medals in tennis did Australia win at the 2000 Olympics?__

- 0
- 1 
- 2 
- 3

In [84]:
# You code here 
data[(data['Sport'] =='Tennis') & (data['Year'] == 2000) 
     & (data['Medal'] == 'Silver') & (data['Team'] == 'Australia')]

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
262820,131504,Todd Andrew Woodbridge,M,29.0,178.0,75.0,Australia,AUS,2000 Summer,2000,Summer,Sydney,Tennis,Tennis Men's Doubles,Silver
262831,131511,Mark Raymond Woodforde,M,34.0,183.0,80.0,Australia,AUS,2000 Summer,2000,Summer,Sydney,Tennis,Tennis Men's Doubles,Silver

__7. Is it true that Switzerland won fewer medals than Serbia at the 2016 Olympics? Do not consider NaN values in _Medal_ column.__ 

- Yes 
- No

In [349]:
new_df7 = data[['Team', 'Medal', 'Year']].dropna()

In [350]:
new_df7[(new_df7['Team'] == 'Switzerland') & (new_df7['Year'] == 2016)].count()

Team     11
Medal    11
Year     11
dtype: int64

In [351]:
new_df7[(new_df7['Team'] == 'Serbia') & (new_df7['Year'] == 2016)].count()

Team     54
Medal    54
Year     54
dtype: int64

In [352]:
data[((data['Team'] == 'Switzerland') | (data['Team'] == 'Serbia')) & (data['Year'] == 2016)].groupby('Team').count()

,ID,Name,Sex,Age,Height,Weight,NOC,Games,Year,Season,City,Sport,Event,Medal
Team,,,,,,,,,,,,,,
Serbia,127,127,127,127,127,127,127,127,127,127,127,127,127,54
Switzerland,148,148,148,148,148,148,148,148,148,148,148,148,148,11

In [199]:
data[(data['Team'] == 'Serbia') & (data['Year'] == 2016)]['Medal'].count()

54

In [197]:
data[(data['Team'] == 'Switzerland') & (data['Year'] == 2016)]['Medal'].count()

11

In [190]:
data[(data['Team'] == 'Switzerland') & (data['Year'] == 2016)]['Medal'].count() < \
data[(data['Team'] == 'Serbia') & (data['Year'] == 2016)]['Medal'].count()

True

In [136]:
# You code here 
df = pd.DataFrame(data[['Team','Year','Medal']].dropna())
df[(df['Team'] == 'Switzerland') & (df['Year'] == 2016)]['Medal'].count() < \
df[(df['Team'] == 'Serbia') & (df['Year'] == 2016)]['Medal'].count()

True

In [191]:
df[(df['Team'] == 'Switzerland') & (df['Year'] == 2016)]['Medal'].count()

11

In [192]:
df[(df['Team'] == 'Serbia') & (df['Year'] == 2016)]['Medal'].count()

54

__8. What age category did the fewest and the most participants of the 2014 Olympics belong to?__
- [45-55] and [25-35) correspondingly
- [45-55] and [15-25) correspondingly
- [35-45] and [25-35) correspondingly
- [45-55] and [35-45) correspondingly

In [5]:
from matplotlib import pyplot as plt
%matplotlib inline

In [353]:
data.head(1)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN

In [362]:
print ("[45:55]: {}".format(data[(data['Age'] >= 45) & (data['Age'] <= 55) & (data['Year'] == 2014)]['Age'].count()))
print ("[35:45]: {}".format(data[(data['Age'] >= 35) & (data['Age'] <= 45) & (data['Year'] == 2014)]['Age'].count()))

[45:55]: 5
[35:45]: 266

In [363]:
print ("[25:35): {}".format(data[(data['Age'] >= 25) & (data['Age'] < 35) & (data['Year'] == 2014)]['Age'].count()))
print ("[15:25): {}".format(data[(data['Age'] >= 15) & (data['Age'] < 25) & (data['Year'] == 2014)]['Age'].count()))
print ("[35:45): {}".format(data[(data['Age'] >= 35) & (data['Age'] < 45) & (data['Year'] == 2014)]['Age'].count()))

[25:35): 2594
[15:25): 2027
[35:45): 265

In [366]:
new_df8 = data[data['Year'] == 2014].drop_duplicates(subset='Name')

In [367]:
len(data)

271116

In [368]:
len(new_df8)

2744

In [369]:
print ("[45:55]: {}".format(new_df8[(new_df8['Age'] >= 45) & (new_df8['Age'] <= 55) & (new_df8['Year'] == 2014)]['Age'].count()))
print ("[35:45]: {}".format(new_df8[(new_df8['Age'] >= 35) & (new_df8['Age'] <= 45) & (new_df8['Year'] == 2014)]['Age'].count()))

[45:55]: 5
[35:45]: 151

In [370]:
print ("[25:35): {}".format(new_df8[(new_df8['Age'] >= 25) & (new_df8['Age'] < 35) & (new_df8['Year'] == 2014)]['Age'].count()))
print ("[15:25): {}".format(new_df8[(new_df8['Age'] >= 15) & (new_df8['Age'] < 25) & (new_df8['Year'] == 2014)]['Age'].count()))
print ("[35:45): {}".format(new_df8[(new_df8['Age'] >= 35) & (new_df8['Age'] < 45) & (new_df8['Year'] == 2014)]['Age'].count()))

[25:35): 1396
[15:25): 1193
[35:45): 150

In [ ]:
 ((data['Age'] >= 25) & (data['Age'] < 35))

In [139]:
data.head(5)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [188]:
# You code here
# WITH droping duplicates
print(data[(data['Age'] <= 55) & (data['Age'] >= 45) & (data['Year'] == 2014)]['Name'].drop_duplicates().count())
print(data[(data['Age'] <= 45) & (data['Age'] >= 35) & (data['Year'] == 2014)]['Name'].drop_duplicates().count())
print(data[(data['Age'] < 35) & (data['Age'] >= 25) & (data['Year'] == 2014)]['Name'].drop_duplicates().count())
print(data[(data['Age'] < 25) & (data['Age'] >= 15) & (data['Year'] == 2014)]['Name'].drop_duplicates().count())
print(data[(data['Age'] < 45) & (data['Age'] >= 35) & (data['Year'] == 2014)]['Name'].drop_duplicates().count())

5
151
1397
1193
150

In [189]:
# You code here
# WITHOUT droping duplicates
print(data[(data['Age'] <= 55) & (data['Age'] >= 45) & (data['Year'] == 2014)]['Name'].count())
print(data[(data['Age'] <= 45) & (data['Age'] >= 35) & (data['Year'] == 2014)]['Name'].count())
print(data[(data['Age'] < 35) & (data['Age'] >= 25) & (data['Year'] == 2014)]['Name'].count())
print(data[(data['Age'] < 25) & (data['Age'] >= 15) & (data['Year'] == 2014)]['Name'].count())
print(data[(data['Age'] < 45) & (data['Age'] >= 35) & (data['Year'] == 2014)]['Name'].count())

5
266
2594
2027
265

__9. Is it true that there were Summer Olympics held in Lake Placid? Is it true that there were Winter Olympics held in Sankt Moritz?__

- Yes, Yes
- Yes, No
- No, Yes 
- No, No

In [371]:
data.head(1)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN

In [186]:
# You code here 
len(data[(data['City'] == 'Lake Placid') & (data['Season'] == 'Summer')])

0

In [184]:
len(data[(data['Season'] == 'Winter') & (data['City'] == 'Sankt Moritz')])

1657

__10. What is the absolute difference between the number of unique sports at the 1995 Olympics and 2016 Olympics?__

- 16
- 24
- 26
- 34

In [375]:
data[data['Year'] == 2016]['Sport'].unique()

array(['Weightlifting', 'Gymnastics', 'Athletics', 'Rowing', 'Taekwondo',
       'Handball', 'Boxing', 'Equestrianism', 'Cycling', 'Volleyball',
       'Diving', 'Shooting', 'Judo', 'Football', 'Synchronized Swimming',
       'Wrestling', 'Fencing', 'Swimming', 'Badminton', 'Rugby Sevens',
       'Table Tennis', 'Water Polo', 'Trampolining', 'Basketball',
       'Triathlon', 'Modern Pentathlon', 'Sailing', 'Beach Volleyball',
       'Golf', 'Rhythmic Gymnastics', 'Archery', 'Hockey', 'Canoeing',
       'Tennis'], dtype=object)

In [175]:
# You code here 
data[data['Year'] == 1995]['Sport']
len(data[data['Year'] == 2016]['Sport'].unique())

34

In [178]:
len(data[data['Year'] == 2016]['Sport'].unique())

34

In [181]:
len(data[data['Year'] == 1995]['Sport'].unique())

0